local 妖塔随机层数 = {
  [1] = {1028, 148},
  [2] = {881, 295},
  [3] = {733, 443},
  [4] = {1148, 268},
  [5] = {1001, 414},
  [6] = {853, 562},
  [7] = {1291, 410},
  [8] = {1144, 557},
  [9] = {996, 705},
}

function 盟重省_雷七道_主对话(玩家, 对话守卫, 选项编号, 界面层数)
  if 玩家.对话页面 == 0 then
    return "妖塔内镇压着诸多妖王，现在妖塔有些损坏，妖王蠢蠢欲动，你确定想镇压一下吗？老夫能送你进去，至于进入后遇到什么事情，老夫就无能为力了！<br>温馨提示：据说只有拥有[妖兽秘卷]，才可召唤妖王！<#SO:1>挑战九层妖塔<#SO/><#SO:2>让我考虑一下<#SO/>"
  end

  if 玩家.对话页面 == 1 then
    return "据说只有拥有[妖兽秘卷]，才可召唤妖王！你还确定要继续挑战妖塔吗？([妖兽秘卷]可通过野外宝箱获取)<#SO:1>挑战九层妖塔(每次需[10]万金币)<#SO/><#SO:2>让我考虑一下<#SO/>"
  end

  if 玩家.对话页面 == 11 then
    if 玩家.当前等级 >= 45 then
      return "你的等级已达到[45]级，挑战妖塔已不适合，请去挑战魔塔！"
    elseif 玩家.所属队伍 ~= nil and 玩家.所属队伍.队长编号 == 玩家.地图编号 then
      local 玩家列表 = 获取在线队友(玩家)
      for key, value in pairs(玩家列表) do
        local 队员 = value
        if 队员.当前等级 < 25 then
          return "[".. 队员.对象名字 .."]等级未达到[25]级，无法挑战妖塔！<#SO:9999>确定<#SO/>"
        elseif 队员.金币数量 < 100000 then
          return "[".. 队员.对象名字 .."]身上不足[10]万金币，无法进行挑战！<#SO:9999>确定<#SO/>"
        end
      end

      local 随机值 = randomNum(1, 9, false)
      玩家.角色数据.脚本变量[数字_妖塔随机到的层数] = 随机值
      for key, value in pairs(玩家列表) do
        local 队员 = value
        队员.金币数量 = 队员.金币数量 - 100000
        队员:玩家切换地图(227, 妖塔随机层数[随机值][1], 妖塔随机层数[随机值][2], 0)
      end
    else
      return "妖塔极其凶险，请组队前往！<#SO:9999>确定<#SO/>"
    end
  end
end
return 盟重省_雷七道_主对话